#include <iostream>

//Пользователь вводит день месяца. Вывести на экран день недели. Считаем, что 1-е число месяца – это вторник.


int main() {

	setlocale(LC_ALL, "Russian");

	int a;

	std::cout << "Введите день месяца: "; std::cin >> a;
	
	if (a == 1 || a == 8 || a == 15 || a == 22 || a == 29) {
		std::cout << "Вторник";
	}
	if (a == 2 || a == 9 || a == 16 || a == 23 || a == 30) {
		std::cout << "Среда";
	}
	if (a == 3 || a == 10 || a == 17 || a == 24 || a == 31) {
		std::cout << "Четверг";
	}
	if (a == 4 || a == 11 || a == 18 || a == 25) {
		std::cout << "Пятница";
	}
	if (a == 5 || a == 12 || a == 19 || a == 26) {
		std::cout << "Суббота";
	}
	if (a == 6 || a == 13 || a == 20 || a == 27) {
		std::cout << "Воскресенье";
	}
	if (a == 7 || a == 14 || a == 21 || a == 28) {
		std::cout << "Понедельник";
	}


	return 0;
}




































